{
    "general": [
      "Keep pushing forward — rejection is redirection.",
      "Every 'no' brings you closer to the right 'yes'.",
      "You're building resilience that will carry you into your next role.",
      "Stay patient — the right opportunity often comes when least expected.",
      "Believe in your skills. You’ve come this far for a reason."
    ],
    "new_york": [
      "In NYC, persistence is everything. Stay bold.",
      "Opportunities here are endless — don’t stop knocking."
    ],
    "los_angeles": [
      "In LA, networking opens doors — stay connected.",
      "Keep your creativity flowing, your chance will come."
    ],
    "chicago": [
      "Chicago is a city of second chances. Keep your head high.",
      "Stay steady, stay strong — the right role will come."
    ],
    "houston": [
      "In Houston, community matters. Reach out and lean on others.",
      "Energy and growth are all around — keep applying!"
    ],
    "phoenix": [
      "Phoenix is built on resilience. Keep rising.",
      "Opportunities here are heating up — stay confident."
    ],
    "philadelphia": [
      "Philly’s a tough city — but so are you.",
      "Stay gritty, your breakthrough is coming."
    ],
    "san_antonio": [
      "In San Antonio, persistence pays off.",
      "Opportunities grow when you keep knocking."
    ],
    "san_diego": [
      "The sun rises on new chances every day in San Diego.",
      "Stay positive, your career wave is coming in."
    ],
    "dallas": [
      "Dallas is a city of momentum — keep building yours.",
      "Connections here matter — keep reaching out."
    ],
    "san_jose": [
      "San Jose thrives on innovation. Keep pushing forward.",
      "Stay curious, opportunities are right around the corner."
    ],
    "austin": [
      "Austin rewards creativity and hustle. Keep moving.",
      "Stay open — the city is full of new possibilities."
    ],
    "jacksonville": [
      "Jacksonville is growing fast — your chance is coming.",
      "Stay determined — opportunities are here."
    ],
    "fort_worth": [
      "Fort Worth is about resilience. Stay strong.",
      "Opportunities are closer than you think."
    ],
    "columbus": [
      "Columbus is built on growth and innovation.",
      "Keep steady — new roles are always opening here."
    ],
    "charlotte": [
      "Charlotte’s energy sector proves persistence wins.",
      "Stay motivated — your role is waiting."
    ],
    "san_francisco": [
      "In the Bay Area, innovation thrives — your opportunity is coming.",
      "Stay open to connections, they often lead to new doors."
    ],
    "indianapolis": [
      "Indy is all about steady growth. Keep going.",
      "Patience here leads to lasting opportunities."
    ],
    "seattle": [
      "Seattle rewards persistence and creativity.",
      "The right role will appear — stay focused."
    ],
    "denver": [
      "Denver is full of fresh starts — yours is coming.",
      "Stay grounded, opportunities are rising like the Rockies."
    ],
    "washington_dc": [
      "In DC, persistence and networking are key.",
      "Keep showing up — your chance will come."
    ],
    "boston": [
      "Boston rewards grit and preparation.",
      "Stay confident — your opportunity will align soon."
    ]
  }
  